In [1]:
import pandas as pd
import acquire
import prepare

In [2]:
# get original file
titanicdf = acquire.get_titanic_data()
titanicdf.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [ ]:
# get original file
irisdf = acquire.get_iris_data()
irisdf.head()

In [ ]:
# prep iris data
irisdf = prepare.prep_iris(irisdf)

In [ ]:
irisdf.head()

In [3]:
# get train, validate, test datasets for titanic data
titanic_train, titanic_validate, titanic_test = prepare.prep_titanic(titanicdf)

In [4]:
titanic_train.head()

,survived,pclass,age,sibsp,parch,fare,embark_town,alone,embark_town_Queenstown,embark_town_Southampton
583,0,1,36.0,0,0,40.1250,Cherbourg,1,0,0
337,1,1,41.0,0,0,134.5000,Cherbourg,1,0,0
50,0,3,7.0,4,1,39.6875,Southampton,0,0,1
218,1,1,32.0,0,0,76.2917,Cherbourg,1,0,0
31,1,1,28.0,1,0,146.5208,Cherbourg,0,0,0

In [5]:
titanic_validate.isnull().sum()

survived                   0
pclass                     0
age                        0
sibsp                      0
parch                      0
fare                       0
embark_town                0
alone                      0
embark_town_Queenstown     0
embark_town_Southampton    0
dtype: int64

In [6]:
titanic_test.isnull().sum()

survived                   0
pclass                     0
age                        0
sibsp                      0
parch                      0
fare                       0
embark_town                0
alone                      0
embark_town_Queenstown     0
embark_town_Southampton    0
dtype: int64